ChinhNV94/ZigbeeRouterEmb/PIC24FRouterEmb/Router.c
    /* Clear the Group Table */
    RemoveAllGroups();

    #if defined(I_SUPPORT_BINDING)
        RemoveAllBindings(macPIB.macShortAddress);
    #endif

    /* Clearing nwk status flags */
    nwkStatus.flags.Val = 0x00;

    /* Initialize for primitive */
    currentPrimitive = NO_PRIMITIVE;
    

    while (1)
    {
        /* Clear the watch dog timer */
        CLRWDT();

        /* Determine which is the next ZigBee Primitive to operate on */
        ZigBeeTasks( &currentPrimitive );

        /* Process the next ZigBee Primitive */
        ProcessZigBeePrimitives();
        
        /* do any non ZigBee related tasks and then go back to ZigBee tasks */
      // ProcessNONZigBeeTasks();
        
        /* use led to identify if device joined */
       #if defined (USE_LED)
            if(Led_Count == 0)
            {
                WSAN_LED=~WSAN_LED;

                if(ZigBeeStatus.flags.bits.bNetworkJoined)
                    Led_Count = BLINK_LED_JOIN;
                else
                    Led_Count = BLINK_LED_NOT_JOIN;
            }
            else
            {
                --Led_Count;
            }
        #endif
    }
    return 1;
}

void ProcessZigBeePrimitives(void)
{
    switch (currentPrimitive)
    {
        case NLME_ROUTE_DISCOVERY_confirm:
            if (!params.NLME_ROUTE_DISCOVERY_confirm.Status)
            {
                printf("Route Reply OK\r\n" );
            }
            else
            {
                PrintChar( params.NLME_ROUTE_DISCOVERY_confirm.Status );
                printf(" Route Reply Failed\r\n" );
            }
            currentPrimitive = NO_PRIMITIVE;
            break;

        case NLME_NETWORK_DISCOVERY_confirm:
            currentPrimitive = NO_PRIMITIVE;

            switch(params.NLME_NETWORK_DISCOVERY_confirm.Status)
            {
                case 0x00:
                    printf("Number of Zigbee network have been find: ");
                    PrintChar(params.NLME_NETWORK_DISCOVERY_confirm.NetworkCount);
                    printf("\r\n");

                    // Save the descriptor list pointer so we can destroy it later.
                    NetworkDescriptor = params.NLME_NETWORK_DISCOVERY_confirm.NetworkDescriptor;

                    // Select a network to try to join.  We're not going to be picky right now...
                    currentNetworkDescriptor = NetworkDescriptor;

SubmitJoinRequest:
                    params.NLME_JOIN_request.PANId = currentNetworkDescriptor->PanID;

                    printf("Prepare join to network: 0x");
                    PrintWord(params.NLME_JOIN_request.PANId.Val);
                    printf("\r\n");

                    if(params.NLME_JOIN_request.PANId.Val != 0x1AAA)
                    {
                        currentNetworkDescriptor = currentNetworkDescriptor->next;
                        if(currentNetworkDescriptor)
                        {
                            goto SubmitJoinRequest;
                        }
                        else
                        {
                            printf("Not found desire network 0x1AAA\r\n");

                            ZigBeeStatus.flags.bits.bNetworkJoined = 0;
                            ZigBeeStatus.flags.bits.bTryingToJoinNetwork = 0;
                        }
                    }
                    else
                    {
                        printf("Found desire network 0x1AAA\r\n");

                        params.NLME_JOIN_request.JoinAsRouter   = TRUE;
                        params.NLME_JOIN_request.RejoinNetwork  = FALSE;
                        params.NLME_JOIN_request.PowerSource    = MAINS_POWERED;
                        params.NLME_JOIN_request.RxOnWhenIdle   = TRUE;
                        params.NLME_JOIN_request.MACSecurity    = FALSE;
                        params.NLME_JOIN_request.ExtendedPANID = currentNetworkDescriptor->ExtendedPANID;

                        currentPrimitive = NLME_JOIN_request;

                        printf("Network(s) found. Trying to join " );
                        PrintWord(params.NLME_JOIN_request.PANId.Val);
                        printf(" | ");
                        for(i=7;i ^ 0xFF;--i)
                            PrintChar(currentNetworkDescriptor->ExtendedPANID.v[i]);
                        printf("\r\n");
                    }
                    break;

                case 0xEA:
                    if (!params.NLME_NETWORK_DISCOVERY_confirm.NetworkCount)
                    {
                        printf("No networks found. Trying again!\r\n" );
                    }
                    break;

                default:
                    PrintChar( params.NLME_NETWORK_DISCOVERY_confirm.Status );
                    printf(" Error finding network. Trying again...\r\n" );
                    break;
            }
            break;

        case NLME_JOIN_confirm:
            if (!params.NLME_JOIN_confirm.Status)
            {
                printf("Join to this network OK!\r\n" );

                // Free the network descriptor list, if it exists. If we joined as an orphan, it will be NULL.
                while (NetworkDescriptor)
                {
                    currentNetworkDescriptor = NetworkDescriptor->next;//tro toi bang mo ta mang tim thay tiep theo
                    nfree( NetworkDescriptor );//giai phong bang mo ta mang truoc do
                    NetworkDescriptor = currentNetworkDescriptor;
                }

                // Start routing capability.
                params.NLME_START_ROUTER_request.BeaconOrder = MAC_PIB_macBeaconOrder;
                params.NLME_START_ROUTER_request.SuperframeOrder = MAC_PIB_macSuperframeOrder;
                params.NLME_START_ROUTER_request.BatteryLifeExtension = FALSE;
                currentPrimitive = NLME_START_ROUTER_request;
            }
            else
            {
                currentPrimitive = NO_PRIMITIVE;
                printf("Status ");
                PrintChar( params.NLME_JOIN_confirm.Status );

                // If we were trying as an orphan, see if we have some more orphan attempts.
                if (ZigBeeStatus.flags.bits.bTryOrphanJoin)
                {
                    // If we tried to join as an orphan, we do not have NetworkDescriptor, so we do
                    // not have to free it.
                    printf(". Could not join as orphan. " );
                    orphanTries--;
                    /* For Zigbee 2006 09/17/07, we now need to do an orphan join after a reset, but
                     * we choose not to do this forever, and quit after a few of retries
                     */
                    if (orphanTries)
                    {
                        printf("Trying join as orphan again!\r\n" );
                    }
                    else
                    {
                        orphanTries = 3;
                        printf("Must now try as a new node...\r\n" );
                        ZigBeeStatus.flags.bits.bTryOrphanJoin = CLEAR;
                    }
                }
                else
                {
                    printf(". Could not join selected network: " );
                    PrintWord(currentNetworkDescriptor->PanID.Val);

