ChinhNV94/ZigbeeRouterEmb/PIC24FRouterEmb/Router.c
        case NLME_RESET_confirm:
            printf("ZigBee Stack has been reset\r\n" );
            /* For Zigbee 2006 The Specs require that node needs to
             * try joining as an orphan first after each reset,
             * see Mandatory test 3.9
            */
            ZigBeeStatus.flags.bits.bTryOrphanJoin = SET;

            currentPrimitive = NO_PRIMITIVE;
            break;

        case NLME_LEAVE_confirm:
            PrintChar(params.NLME_LEAVE_confirm.Status);
            printf(" Leaving the Zigbee network\r\n" );

            currentPrimitive = NO_PRIMITIVE;
            break;

        case APSDE_DATA_indication:
            {
                currentPrimitive = NO_PRIMITIVE;

                switch (params.APSDE_DATA_indication.DstEndpoint)
                {
                    // ************************************************************************
                    // Place a case for each user defined endpoint.
                    // ************************************************************************
                    case WSAN_Dst:
                    {
                        switch(params.APSDE_DATA_indication.ClusterId.Val)
                        {
                            case SLEEP_CONFIRM_CLUSTER://1
                                printf("#VL:");
                                PrintChar(APLGet());
                                printf("\r\n");
                                break;

                            case WAKE_CONFIRM_CLUSTER://2
                                printf("#WC:");
                                PrintChar(APLGet());
                                printf("\r\n");
                                break;

                            case STATE_NODE_CLUSTER://3
                                printf("#SN:");
                                PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);
                                PrintChar(APLGet());//MM
                                PrintChar(APLGet());//SS
                                printf("\r\n");
                                break;

                            case STATUS_RESPONSE://4
                            {
                                printf ("#SC:");
                                PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);
                                PrintChar(APLGet());//Byte0 dia chi MAC
                                PrintChar(APLGet());//STATUS
                                printf ("\r\n");
                            }
                            break;

                            case NONE_SUPPORT://5
                            {
                                printf ("#SC:");
                                PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);
                                PrintChar(APLGet());//Byte0 dia chi MAC
                                PrintChar(APLGet());//Byte0 dia chi MAC
                                printf ("None support!\r\n");
                            }
                            break;

                            case JOIN_CONFIRM_CLUSTER://6
                                printf("#JN:");
                                ADD=params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val;
                                PrintWord(ADD);
                                //printf("---");
                                PrintChar(APLGet()); //MM
                                APLGet();//Rejected byte
                                printf("\r\n");
                                #if defined(USE_LED)
                                    WSAN_LED = ~WSAN_LED;
                                #endif
                                break;

                            case HTE_RESPONSE_CLUSTER://7
                                {
                                    printf("#RD:");
                                    PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);
                                    PrintChar(APLGet());//Byte0 dia chi MAC
                                    PrintChar(APLGet());//nhiet do
                                    PrintChar(APLGet());
                                    PrintChar(APLGet());//do am
                                    PrintChar(APLGet());
                                    PrintChar(APLGet());//dien ap
                                    PrintChar(APLGet());
                                    
                                    printf("\r\n");
                                    #if defined(USE_LED)
                                        WSAN_LED = ~WSAN_LED;
                                    #endif
                                }
                                break;

                            case HTE_AUTO_SEND_CLUSTER://8
                                {
                                    printf("#AD:");
                                    PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);
                                    PrintChar(APLGet());//Byte0 dia chi MAC
                                    PrintChar(APLGet());//nhiet do
                                    PrintChar(APLGet());
                                    PrintChar(APLGet());//do am
                                    PrintChar(APLGet());
                                    PrintChar(APLGet());//dien ap
                                    PrintChar(APLGet());
                                    printf("\r\n");
                                    }
                                break;
                                /******************Camera command********************/
                                case CMR_RESPONSE_CLUSTER://9
                                {
                                    printf("#RC:");// khai bao moi
                                    PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);
                                    PrintChar(APLGet());//Byte0 dia chi MAC
                                    PrintChar(APLGet());//2 byte do dai anh
                                    PrintChar(APLGet());
                                    PrintChar(APLGet());
                                    for(i=0;i<80;i++){  //nhan data anh
                                        test=APLGet();
                                        PrintChar(test);
                                        if(test_1==0xFF && test==0xD9)break;
                                        test_1=test;
                                    };
                                    printf("\n");
                                    #if defined(USE_LED)
                                       WSAN_LED = ~WSAN_LED;
                                    #endif
                               
