ChinhNV94/ZigbeeRouterEmb/PIC24FRouterEmb/Router.c
                                }
                                break;
                            /* Place other Cluster.ID cases here */
                                case ACTOR_RESPONSE_CLUSTER://10
                                {
                                    printf("#OK:");
                                    PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);//Dia chi mang node gui
                                    PrintChar(APLGet());//Byte0 dia chi MAC ndoe gui
                                    PrintChar(APLGet());//Ma xac nhan cua Actor
                                    printf("\r\n");
                                    #if defined(USE_LED)
                                       WSAN_LED = ~WSAN_LED;
                                    #endif
                                }
                                break;

                                case ROUTE_DRAW_REPLY_CLUSTER://11
                                    {
                                        BYTE i;
                                        BYTE NodeNumber;
                                        BYTE *pListNode;
                                        printf("#TR:");
                                        PrintWord(params.APSDE_DATA_indication.SrcAddress.ShortAddr.Val);//Dia chi mang node gui
                                        NodeNumber = APLGet();//Lay ro so node mang goi tin di qua
                                        PrintChar(NodeNumber);
                                        for (i = 0; i<NodeNumber;i++) PrintChar(APLGet());
                                        printf("\r\n");
                                    }
                                    break;

                            default:
                                break;
                        }   /* switch end*/

                        if( currentPrimitive != APSDE_DATA_request )
                            TxData = TX_DATA_START;
                    }           /* if msg */
                        break;

                    default:
                        break;
                }
                APLDiscardRx();
            }
            break;

        case APSDE_DATA_confirm:
            if (params.APSDE_DATA_confirm.Status)
            {
                PrintChar(params.APSDE_DATA_confirm.Status);
                printf(" Error sending message\r\n");
            }
            else
            {
                printf("Sending message OK!\r\n" );
            }
            currentPrimitive = NO_PRIMITIVE;
            break;

        case APSME_ADD_GROUP_confirm:
        case APSME_REMOVE_GROUP_confirm:
        case APSME_REMOVE_ALL_GROUPS_confirm:
            printf("Perform Group Operation\r\n" );
            currentPrimitive = NO_PRIMITIVE;
            break;

        case NO_PRIMITIVE:
            //if the router has not joined any network, do the following
            if (AllowJoin &&!ZigBeeStatus.flags.bits.bNetworkJoined)
            {
                //if the router has not tried to join any network
                if (!ZigBeeStatus.flags.bits.bTryingToJoinNetwork)
                {
                    //if the router want to join as an orphan
                    if (ZigBeeStatus.flags.bits.bTryOrphanJoin)
                    {
                        printf("Trying to join network as an orphan...\r\n" );

                        params.NLME_JOIN_request.ScanDuration     = 8;
                        params.NLME_JOIN_request.ScanChannels.Val = ALLOWED_CHANNELS;
                        params.NLME_JOIN_request.JoinAsRouter     = TRUE;
                        params.NLME_JOIN_request.RejoinNetwork    = 0x01;
                        params.NLME_JOIN_request.PowerSource      = MAINS_POWERED;
                        params.NLME_JOIN_request.RxOnWhenIdle     = TRUE;
                        params.NLME_JOIN_request.MACSecurity      = FALSE;

                        params.NLME_JOIN_request.ExtendedPANID = currentNetworkDescriptor->ExtendedPANID;
                        currentPrimitive = NLME_JOIN_request;
                    }
                    else
                    {
                        printf("Trying to join network as a new device!\r\n" );
                        params.NLME_NETWORK_DISCOVERY_request.ScanDuration          = 8;
                        params.NLME_NETWORK_DISCOVERY_request.ScanChannels.Val      = ALLOWED_CHANNELS;
                        currentPrimitive = NLME_NETWORK_DISCOVERY_request;
                    }
                }
            }
            else
            {
                #ifdef USE_COMPUTER
                if (ZigBeeReady() & (!ZigBeeStatus.flags.bits.bHasBackgroundTasks))
                {
                    if(EnableSendCmd)
                    {
                        Addr_MSB = GetHexByte(Val[0],Val[1]);
                        Addr_LSB = GetHexByte(Val[2],Val[3]);
                        Cmd = GetHexByte(Val[4],Val[5]);

                        printf("Command: ");
                        PrintChar(Addr_MSB);
                        PrintChar(Addr_LSB);
                        PrintChar(Cmd);
                        printf("\r\n");

                        //Neu Buffer[2] = 0x00 -> yeu cau du lieu nhiet do - do am
                        //Neu Buffer[2] != 0x00 -> yeu cau bat van
                                                //for send broadcast messages
                        if ((Addr_MSB == 0xff)&&(Addr_LSB == 0xff))
                        {
                            ContentCmd = Cmd & 0x1F;//take content of cmd
                            ServiceCmd = Cmd >> 5;//take kind of cmd

                            switch (ServiceCmd)
                            {
                                case 1:
                                    SendOneByte(SLEEP_SYN_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    EnableSendCmd = CLEAR;
                                    #ifdef USE_USART
                                        printf("Sleep request OK\r\n");
                                    #endif
                                    break;

