ChinhNV94/ZigbeeRouterEmb/PIC24FRouterEmb/Router.c
                                case 2:
                                    #ifdef USE_EXTERNAL_NVM
                                        pCurrentRoutingEntry = routingTable;   //+ (WORD)neighborIndex * (WORD)sizeof(NEIGHBOR_RECORD);
                                    #else
                                        pCurrentRoutingEntry = &(routingTable[0]);
                                    #endif
                                    printf("#RT:");
                                    PrintChar(macPIB.macShortAddress.v[1]);
                                    PrintChar(macPIB.macShortAddress.v[0]);
                                    for ( i=0; i < ROUTING_TABLE_SIZE-RESERVED_ROUTING_TABLE_ENTRIES; i++ )
                                    {
                                        GetRoutingEntry(&currentRoutingEntry,pCurrentRoutingEntry);
                                        if ((currentRoutingEntry.destAddress.byte.MSB !=0xff))
                                        {
                                            PrintChar(currentRoutingEntry.destAddress.byte.MSB);
                                            PrintChar(currentRoutingEntry.destAddress.byte.LSB);
                                            PrintChar(currentRoutingEntry.nextHop.byte.MSB);
                                            PrintChar(currentRoutingEntry.nextHop.byte.LSB);
                                        }
                                        #ifdef USE_EXTERNAL_NVM
                                            pCurrentRoutingEntry += (WORD)sizeof(ROUTING_ENTRY);
                                        #else
                                            pCurrentRoutingEntry++;
                                        #endif
                                    }
                                    printf("\r\n");
                                    SendOneByte(ROUTING_TABLE_READ_CLUSTER, Addr_MSB, Addr_LSB, Cmd);
                                    EnableSendCmd = CLEAR;
                                    #ifdef USE_USART
                                        printf("Read Routing Table request OK");
                                    #endif
                                    break;

                                case 0x:
                                    SendOneByte(RE_CONFIG_CYCLE_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    break;

                                case 5:
                                    SendOneByte(RE_ASSIGN_LEVEL_MQ6_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    break;

                                default:
                                    break;
                            }
                        }
                        else
                        {
                            //for send unicast message
                            switch (Cmd)
							{
							case 0x00://Lay nhiet do - do am sensor
								SendOneByte(HTE_REQUEST_CLUSTER, Addr_MSB,Addr_LSB,Cmd);
							break;
							case 0xF1://Yeu cau ve tuyen
							SendRouteDrawRequest(Addr_MSB, Addr_LSB);
							break;
                            default://Gui lenh cho Actor
                            SendOneByte(ACTOR_REQUEST_CLUSTER, Addr_MSB,Addr_LSB,Cmd);
							break;
                            EnableSendCmd = CLEAR;
							}
                        }
                    }
                }//end computer
                #else
                if (ZigBeeReady() & (!ZigBeeStatus.flags.bits.bHasBackgroundTasks))
                {
                    if(EnableSendCmd)
                    {
                        //for send broadcast messages
                        if ((Addr_MSB == 0xff)&&(Addr_LSB == 0xff))
                        {
                            ContentCmd = Cmd & 0x0F;//take content of cmd
                            ServiceCmd = Cmd & 0xF0;//take kind of cmd

                            switch (ServiceCmd)
                            {
                                //che do tiet kiem nang luong: tat - ngu luan phien
                                case 0x00:
                                    //Neu ContentCmd = 0x01 thi chuyen tu che do active --> tiet kiem nang luong.
                                    //Neu ContentCmd = 0x02 thi chuyen tu che do tiet kiem nang luong --> active.
                                    SendOneByte(SLEEP_SYN_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    EnableSendCmd = CLEAR;

                                    if(ContentCmd == 0x01)
                                        printf("Sleep request OK\r\n");
                                    if(ContentCmd == 0x02)
                                    	printf("Normal Mode requested OK\r\n");
                                    break;

                                //thay doi chu ki gui du lieu nhiet do do am trong che do active.
                                case 0x10:
                                    SendOneByte(RE_CONFIG_CYCLE_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    EnableSendCmd = CLEAR;
                                    break;

                                //thay doi nguong so sanh cam bien MQ6_V1
                                case 0x20:
                                    SendOneByte(RE_ASSIGN_LEVEL_MQ6_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    EnableSendCmd = CLEAR;
                                    break;
                                case 0x30:
                                    SendOneByte(HTE_REQUEST_CLUSTER, Addr_MSB, Addr_LSB, ContentCmd);
                                    EnableSendCmd = CLEAR;
                                    break;

                                default:
                                    SendOneByte(REQUEST_NODE, Addr_MSB, Addr_LSB, ContentCmd);
                                    EnableSendCmd = CLEAR;
                                    break;
                           }
                        }
                        else
                        {
                            switch(Cmd)
                            {
                                case 0x00:
                                    SendOneByte(HTE_REQUEST_CLUSTER, Addr_MSB,Addr_LSB,Cmd);//Lay nhiet do - do am sensor
                                    break;
                                case 0x01:
                                    SendOneByte(RESET_NODE, Addr_MSB,Addr_LSB,Cmd);
                                    break;
                                case 0x40:// khai bao moi
                                    SendOneByte(CMR_REQUEST_CLUSTER, Addr_MSB,Addr_LSB,Cmd);//Lay anh sensor                                   
                                    break;
                                    ////////////////////////////////////////////////
                                    //CMD retasking: 0x1*
                                    //* = (0Y1Y2Y3)b
                                    //Y3: SHT10; Y2:PTC06; Y1: Che do gui dinh ki////Y=0:tat, 1:bat
                                case 0x50://000:tat het cac chuc nang
                                    SendOneByte(RETASK_FUNCTION, Addr_MSB,Addr_LSB,Cmd);
                                    break;
                                case 0x51://001
                                    SendOneByte(RETASK_FUNCTION, Addr_MSB,Addr_LSB,Cmd);
                                    break;
                                case 0x52://010
                                    SendOneByte(RETASK_FUNCTION, Addr_MSB,Addr_LSB,Cmd);
                                    break;
                                case 0x53://011
                                    SendOneByte(RETASK_FUNCTION, Addr_MSB,Addr_LSB,Cmd);
                                    break;
                                case 0x54://100
                                    SendOneByte(RETASK_FUNCTION, Addr_MSB,Addr_LSB,Cmd);
                                    break;
                                case 0x55://101
                                    SendOneByte(RETASK_FUNCTION, Addr_MSB,Addr_LSB,Cmd);
                                    break;
                                case 0x56://110
                                    SendOneByte(RETASK_FUNCTION, Addr_MSB,Addr_LSB,Cmd);
                                    break;
                                case 0x57://111
                                    SendOneByte(RETASK_FUNCTION, Addr_MSB,Addr_LSB,Cmd);
                                    break;
                                case 0x58://lay thong tin node mang
                                    SendOneByte(STATUS_REQUEST, Addr_MSB,Addr_LSB,Cmd);//thong bao trang thai node mang
                                    break;
                                ////////////////////////////////////////////////   

                                case 0xF1:
                                    SendRouteDrawRequest(Addr_MSB, Addr_LSB);	//Yeu cau ve tuyen
                                    break;

                                default:
                                    SendOneByte(ACTOR_REQUEST_CLUSTER, Addr_MSB,Addr_LSB,Cmd);//Gui lenh cho Actor
                                    break;
                            }

                            EnableSendCmd = CLEAR;
                        }
                    }
                }
                #endif
            }
            break;

        default:
            PrintChar( currentPrimitive );
            printf(" Unhandled primitive\r\n" );
            currentPrimitive = NO_PRIMITIVE;
            break;
    }
}

void HardwareInit(void)
{
    /*Configure digital pins @ added by dat_a3cbq91*/
    ANSE = 0x0000;
    ANSG = 0x0000;
    ANSD = 0x0000;

